admin_panel/ADMIN_SIGNUP_DELECTION_TESTING/admin_signup_delection_testing-Combined-JMeter-and-Selenium.yaml
---
# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: admin_signup_delection_testing-Selenium
  hold-for: 20m

- executor: jmeter
  scenario: admin_signup_delection_testing-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  admin_signup_delection_testing-Selenium:
    browser: Chrome  # available browsers are: ["Firefox", "Chrome", "Ie", "Opera"]
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - go(http://localhost:33143/Administator/UserSignUp)
      - clickByCSS(button.btn.btn-primary.my)
      - clickByLinkText(Delete)
      - clickByXPath((//a[contains(text(),'Delete')])[2])

  admin_signup_delection_testing-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36'
      Referer: 'http://localhost:33143/Administator/UserSignUp'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:33143/Administator/signupDelete/8'
            method: GET
            label: 'http://localhost:33143/Administator/signupDelete/8'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAADmAvb5l5xXUu%2BPukarcW%2BS0Oe6yonGKqs5dGtn2hWTXAAAAAAOgAAAAAIAACAAAABhLYEq8s8VtR1uJOwK9iJP3lKgdedubMOCCxGhIwLXkDAAAADKhP%2FUc3SuGl363NDuG0Pt9l2Q06qKA3nO4PD4d7TXsmzkJxDnJ%2Fl%2FsLB9oA6JXRtAAAAAjmZS%2Fv1ivh8VDx5P9WW8VodfON4GhaENPpTH1Xv2ho1NrTdg3hGCZDMHzrxffIBhqHJMBLvcWjYp2Cw0GIyPdw%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FUserSignUp&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAADmAvb5l5xXUu%2BPukarcW%2BS0Oe6yonGKqs5dGtn2hWTXAAAAAAOgAAAAAIAACAAAABhLYEq8s8VtR1uJOwK9iJP3lKgdedubMOCCxGhIwLXkDAAAADKhP%2FUc3SuGl363NDuG0Pt9l2Q06qKA3nO4PD4d7TXsmzkJxDnJ%2Fl%2FsLB9oA6JXRtAAAAAjmZS%2Fv1ivh8VDx5P9WW8VodfON4GhaENPpTH1Xv2ho1NrTdg3hGCZDMHzrxffIBhqHJMBLvcWjYp2Cw0GIyPdw%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FUserSignUp&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
            body:
              requestUrl: 'http://localhost:33143/Administator/UserSignUp'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546070433808'
          - url: 'http://localhost:33143/__browserLink/requestData/333d6ee6264e45f6ae90103d355f7324'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/333d6ee6264e45f6ae90103d355f7324'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest
          - url: 'http://localhost:33143/Administator/signupDelete/12'
            method: GET
            label: 'http://localhost:33143/Administator/signupDelete/12'
            think-time: 637ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8'
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABVFSp4EbwRJczNPV3dVLo4A%2FaYqNDNx4WX%2Bxwea75olAAAAAAOgAAAAAIAACAAAADF3k51ww7FTHv5KxykqME1nAO%2FZpw2c4MZoTp6rmq1TDAAAABEIubmNLb5IF55J32ACPNkNVV7y6M%2FEKJ2XwEzTk7RwFGk4RcrMhvhH5ZGraHSX6hAAAAASg0xYyFbcK5v0inhXAGvwZSERbFyJajZs%2BB88tJI3BxrwnkIoHD1ZXdjleIgXuZ0p7YzYkBuo1lHrmqY5Edx2A%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FUserSignUp&browserName=Chrome'
            method: POST
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/abort?transport=webSockets&connectionToken=AQAAANCMnd8BFdERjHoAwE%2FCl%2BsBAAAAxjzWcLo0lUGw9PxkRdhOIgAAAAACAAAAAAAQZgAAAAEAACAAAABVFSp4EbwRJczNPV3dVLo4A%2FaYqNDNx4WX%2Bxwea75olAAAAAAOgAAAAAIAACAAAADF3k51ww7FTHv5KxykqME1nAO%2FZpw2c4MZoTp6rmq1TDAAAABEIubmNLb5IF55J32ACPNkNVV7y6M%2FEKJ2XwEzTk7RwFGk4RcrMhvhH5ZGraHSX6hAAAAASg0xYyFbcK5v0inhXAGvwZSERbFyJajZs%2BB88tJI3BxrwnkIoHD1ZXdjleIgXuZ0p7YzYkBuo1lHrmqY5Edx2A%3D%3D&requestUrl=http%3A%2F%2Flocalhost%3A33143%2FAdministator%2FUserSignUp&browserName=Chrome'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
          - url: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            method: GET
            label: 'http://localhost:45157/6639822e5924419d907fe0f7a5fe5d63/arterySignalR/negotiate'
            headers:
              Accept: 'text/plain, */*; q=0.01'
              Origin: 'http://localhost:33143'
              Content-Type: application/x-www-form-urlencoded; charset=UTF-8
            body:
              requestUrl: 'http://localhost:33143/Administator/UserSignUp'
              browserName: Chrome
              clientProtocol: '1.3'
              _: '1546070436073'
          - url: 'http://localhost:33143/__browserLink/requestData/653d13c43d2646d989babfaff809f3bc'
            method: GET
            label: 'http://localhost:33143/__browserLink/requestData/653d13c43d2646d989babfaff809f3bc'
            headers:
              Accept: 'application/json, text/javascript, */*; q=0.01'
              X-Requested-With: XMLHttpRequest